var societylist = [{
	id: "CA-CHR",
	name: "香港中文大學學生會合唱學會20-21"
},{
	id: "CA-MDS",
	name: "香港中文大學學生會現代舞學會20-21"
},{
	id: "CA-ORC",
	name: "香港中文大學學生會香港中文大學學生管弦樂團20-21"
},{
	id: "CA-PHS",
	name: "香港中文大學學生會愛樂會20-21"
},{
	id: "CA-PLA",
	name: "香港中文大學學生會無伴奏合唱團20-21"
},{
	id: "CA-PTD",
	name: "香港中文大學學生會普通話劇社20-21"
},{
	id: "CA-SSO",
	name: "香港中文大學學生會歌唱學會20-21"
},{
	id: "CA-ZOR",
	name: "香港中文大學學生會中樂團20-21"
},{
	id: "CB-AIE",
	name: "香港中文大學學生會國際經濟商學生協會中大分會20-21"
},{
	id: "CB-CDS",
	name: "香港中文大學學生會大學職業發展學會20-21"
},{
	id: "CB-CTS",
	name: "香港中文大學學生會中國貿易學會20-21"
},{
	id: "CB-ENA",
	name: "香港中文大學學生會創行學會20-21"
},{
	id: "CB-NAM",
	name: "香港中文大學學生會新紀元行政管理精英學會20-21"
},{
	id: "CB-REI",
	name: "香港中文大學學生會房地產投資學會20-21"
},{
	id: "CB-SIS",
	name: "香港中文大學學生會投資學會20-21"
},{
	id: "CB-SMS",
	name: "香港中文大學學生會市場營銷學會20-21"
},{
	id: "CC-ACS",
	name: "香港中文大學學生會動漫畫研究社20-21"
},{
	id: "CC-AYP",
	name: "香港青年獎勵計劃香港中文大學學生會執行處支部20-21"
},{
	id: "CC-BRC",
	name: "香港中文大學學生會橋牌學會20-21"
},{
	id: "CC-CHS",
	name: "香港中文大學學生會桌上遊戲及棋藝會20-21"
},{
	id: "CC-DOU",
	name: "香港中文大學學生會同人文化學會20-21"
},{
	id: "CC-KCS",
	name: "香港中文大學學生會韓國文化學會20-21"
},{
	id: "CC-MGS",
	name: "香港中文大學學生會屬會魔術學會20-21"
},{
	id: "CC-MJS",
	name: "香港中文大學學生會麻雀研究學會20-21"
},{
	id: "CC-MOV",
	name: "香港中文大學學生會電影會20-21"
},{
	id: "CC-OAS",
	name: "香港中文大學學生會縱行者20-21"
},{
	id: "CC-WTS",
	name: "香港中文大學學生會品酒學會20-21"
},{
	id: "CL-FRE",
	name: "香港中文大學學生會法文學會20-21"
},{
	id: "CL-GRE",
	name: "香港中文大學學生會德文學會20-21"
},{
	id: "CL-JAP",
	name: "香港中文大學學生會日文學會20-21"
},{
	id: "CL-SPN",
	name: "香港中文大學學生會西班牙語言及文化學會20-21"
},{
	id: "CL-TPC",
	name: "香港中文大學學生會吐露詩社20-21"
},{
	id: "CL-YLA",
	name: "香港中文大學學生會青年文學獎協會20-21"
},{
	id: "CN-MUA",
	name: "香港中文大學學生會內地本科生聯合會20-21"
},{
	id: "CN-TAI",
	name: "香港中文大學學生會台灣學生會20-21"
},{
	id: "CO-ADS",
	name: "香港中文大學學生會農業發展組20-21"
},{
	id: "CO-CMY",
	name: "香港中文大學學生會香港基督教青年會專上學生聯會20-21"
},{
	id: "CO-GRE",
	name: "香港中文大學學生會綠色天地20-21"
},{
	id: "CO-GRP",
	name: "香港中文大學學生會綠色報20-21"
},{
	id: "CO-GSX",
	name: "香港中文大學學生會國是學會20-21"
},{
	id: "CO-GZC",
	name: "香港中文大學學生會崇德青年社20-21"
},{
	id: "CO-PSY",
	name: "香港中文大學學生會心理學推廣學會20-21"
},{
	id: "CO-SST",
	name: "香港中文大學學生會社會服務工作隊20-21"
},{
	id: "CO-SXS",
	name: "香港中文大學學生會三心社20-21"
},{
	id: "CO-UNC",
	name: "香港中文大學學生會香港模擬聯合國協會中大分會20-21"
},{
	id: "CO-UNY",
	name: "大學青年會（香港中文大學）20-21"
},{
	id: "CO-YCS",
	name: "香港中文大學學生會青年公民社會20-21"
},{
	id: "CP-ARH",
	name: "香港中文大學學生會射藝會20-21"
},{
	id: "CP-CMA",
	name: "香港中文大學學生會精武武術學會20-21"
},{
	id: "CP-DGB",
	name: "香港中文大學學生會龍舟會20-21"
},{
	id: "CP-IDO",
	name: "香港中文大學學生會居合道及日本劍術學會20-21"
},{
	id: "CP-JDB",
	name: "香港中文大學學生會柔道部20-21"
},{
	id: "CP-KAR",
	name: "香港中文大學學生會空手道部20-21"
},{
	id: "CP-RBC",
	name: "香港中文大學學生會欖球會20-21"
},{
	id: "CP-RWC",
	name: "香港中文大學學生會划艇會20-21"
},{
	id: "CP-SAC",
	name: "香港中文大學學生會帆船學會20-21"
},{
	id: "CP-SCA",
	name: "香港中文大學學生會攀石學會20-21"
},{
	id: "CP-SFB",
	name: "香港中文大學學生會壘球會20-21"
},{
	id: "CP-TKD",
	name: "香港中文大學學生會跆拳道會20-21"
},{
	id: "CR-BMT",
	name: "香港中文大學學生會羽毛球學會20-21"
},{
	id: "CR-BUD",
	name: "香港中文大學學生會佛教同學會20-21"
},{
	id: "CR-CAS",
	name: "香港中文大學學生會天主教同學會20-21"
},{
	id: "CR-CCC",
	name: "香港中文大學學生會學園傳道會20-21"
},{
	id: "CR-CES",
	name: "香港中文大學學生會基督徒國際交流學會20-21"
},{
	id: "CR-CHB",
	name: "香港中文大學學生會基督徒樂隊20-21"
},{
	id: "CR-CHC",
	name: "香港中文大學學生會基督徒詩班20-21"
},{
	id: "CR-FES",
	name: "香港中文大學學生會學生福音團契20-21"
},{
	id: "CR-ICK",
	name: "香港中文大學學生會木球學會20-21"
},{
	id: "CR-SCM",
	name: "香港中文大學學生會基督徒學生運動20-21"
},{
	id: "CS-ASC",
	name: "香港中文大學學生會天文學會20-21"
},{
	id: "CS-BCM",
	name: "香港中文大學學生會中醫推廣學會20-21"
},{
	id: "CS-DBS",
	name: "香港中文大學學生會辯論學會20-21"
},{
	id: "CS-MET",
	name: "香港中文大學學生會氣象學會20-21"
},{
	id: "CS-OEP",
	name: "香港中文大學學生會《獨立時代》中文電子雜誌社20-21"
},{
	id: "CS-PDT",
	name: "香港中文大學學生會國語辯論隊20-21"
},{
	id: "CS-WAR",
	name: "香港中文大學學生會戰史學會20-21"
},{
	id: "SA-ANT",
	name: "香港中文大學學生會人類學系系會20-21"
},{
	id: "SA-CHI",
	name: "香港中文大學學生會中國語文及文學系系會20-21"
},{
	id: "SA-CMT",
	name: "香港中文大學學生會文化管理文學士課程系會20-21"
},{
	id: "SA-CRS",
	name: "香港中文大學學生會文化及宗教研究系系會20-21"
},{
	id: "SA-ENG",
	name: "香港中文大學學生會英文系系會20-21"
},{
	id: "SA-HIS",
	name: "香港中文大學學生會歷史系系會20-21"
},{
	id: "SA-JAS",
	name: "香港中文大學學生會日本研究學系系會20-21"
},{
	id: "SA-LIN",
	name: "香港中文大學學生會語言學及現代語言系系會20-21"
},{
	id: "SA-PHI",
	name: "香港中文大學學生會哲學系系會20-21"
},{
	id: "SA-TRA",
	name: "香港中文大學學生會翻譯系系會20-21"
},{
	id: "SB-1",
	name: "香港中文大學學生會商學院院會20-21"
},{
	id: "SB-HMG",
	name: "香港中文大學學生會酒店及旅遊管理學系系會20-21"
},{
	id: "SB-IFA",
	name: "香港中文大學學生會保險、金融與精算學系系會20-21"
},{
	id: "SB-PAC",
	name: "香港中文大學學生會會計學院系會20-21"
},{
	id: "SB-QFN",
	name: "香港中文大學學生會計量金融學系系會20-21"
},{
	id: "SE-ECE",
	name: "香港中文大學學生會幼兒教育課程系會20-21"
},{
	id: "SE-ESE",
	name: "香港中文大學學生會運動科學與健康教育課程學會20-21"
},{
	id: "SE-LED",
	name: "香港中文大學學生會語文教育學會20-21"
},{
	id: "SE-LSE",
	name: "香港中文大學學生會通識教育學會20-21"
},{
	id: "SE-MED",
	name: "香港中文大學學生會數學及數學教育課程系會20-21"
},{
	id: "SE-SPE",
	name: "香港中文大學學生會體育及運動科學(教育學士)系會20-21"
},{
	id: "SI-GEF",
	name: "香港中文大學學生會環球經濟與金融學系系會20-21"
},{
	id: "SL-LLB",
	name: "香港中文大學學生會法律學院院會20-21"
},{
	id: "SM-BMS",
	name: "香港中文大學學生會生物醫學學院院會20-21"
},{
	id: "SM-CMD",
	name: "香港中文大學學生會中醫學院院會20-21"
},{
	id: "SM-GER",
	name: "香港中文大學學生會那打素護理學院老年學系系會20-21"
},{
	id: "SM-MED",
	name: "香港中文大學學生會醫學院院會20-21"
},{
	id: "SM-NRS",
	name: "香港中文大學學生會那打素護理學院院會20-21"
},{
	id: "SM-PBH",
	name: "香港中文大學學生會公共衛生學及基層醫療系會20-21"
},{
	id: "SM-PHA",
	name: "香港中文大學學生會藥劑學院院會20-21"
},{
	id: "SN-1",
	name: "香港中文大學學生會工程學院院會20-21"
},{
	id: "SN-BME",
	name: "香港中文大學學生會生物醫學工程學系系會20-21"
},{
	id: "SN-CSC",
	name: "香港中文大學學生會計算機科學系會20-21"
},{
	id: "SN-EEE",
	name: "香港中文大學學生會電子工程學系系會20-21"
},{
	id: "SN-ENE",
	name: "香港中文大學學生會能源工程學系會20-21"
},{
	id: "SN-IEG",
	name: "香港中文大學學生會信息工程系系會20-21"
},{
	id: "SN-MAE",
	name: "香港中文大學學生會機械與自動化工程學系系會20-21"
},{
	id: "SN-SEM",
	name: "香港中文大學學生會系統工程與工程管理學系系會20-21"
},{
	id: "SO-ARC",
	name: "香港中文大學學生會建築系系會20-21"
},{
	id: "SO-BBA",
	name: "香港中文大學學生會社會科學院（大類收生）學生會20-21"
},{
	id: "SO-ECO",
	name: "香港中文大學學生會經濟系系會20-21"
},{
	id: "SO-GLB",
	name: "香港中文大學學生會全球研究課程系會20-21"
},{
	id: "SO-GLS",
	name: "香港中文大學學生會全球研究課程（四年制）系會20-21"
},{
	id: "SO-GPA",
	name: "香港中文大學學生會政治與行政學系系會20-21"
},{
	id: "SO-GRM",
	name: "香港中文大學學生會地理與資源管理系系會20-21"
},{
	id: "SO-JLM",
	name: "香港中文大學學生會新聞與傳播學院院會20-21"
},{
	id: "SO-PSY",
	name: "香港中文大學學生會心理學系系會20-21"
},{
	id: "SO-SOC",
	name: "香港中文大學學生會社會學系系會20-21"
},{
	id: "SO-SWK",
	name: "香港中文大學學生會社會工作學系系會20-21"
},{
	id: "SO-URS",
	name: "香港中文大學學生會城市研究課程系會20-21"
},{
	id: "SS-1",
	name: "香港中文大學學生會理學院院會20-21"
},{
	id: "SS-BCH",
	name: "香港中文大學學生會生物化學系系會20-21"
},{
	id: "SS-BIO",
	name: "香港中文大學學生會生物系系會20-21"
},{
	id: "SS-CHM",
	name: "香港中文大學學生會化學系系會20-21"
},{
	id: "SS-CMB",
	name: "香港中文大學學生會細胞及分子生物學系系會20-21"
},{
	id: "SS-ENS",
	name: "香港中文大學學生會環境科學系系會20-21"
},{
	id: "SS-ESS",
	name: "香港中文大學學生會地球系統科學系系會20-21"
},{
	id: "SS-FNS",
	name: "香港中文大學學生會食品及營養科學系會20-21"
},{
	id: "SS-MAT",
	name: "香港中文大學學生會數學系系會20-21"
},{
	id: "SS-MBT",
	name: "香港中文大學學生會分子生物技術學系系會20-21"
},{
	id: "SS-NSC",
	name: "香港中文大學學生會自然科學系系會20-21"
},{
	id: "SS-PHY",
	name: "香港中文大學學生會物理系系會20-21"
},{
	id: "SS-STA",
	name: "香港中文大學學生會統計系系會20-21"
},{
	id: "XX-TST",
	name: "香港中文大學學生會屬下團體系統測試學會20-21"
},{
	id: "SM-NRS2",
	name: "香港中文大學學生會那打素護理學院院會(2019-2020)20-21"
},{
	id: "CC-DOU2",
	name: "香港中文大學學生會同人文化學會201920-21"
},{
	id: "ZZ-NEW1",
	name: "同行之友愛鄰社20-21"
}]
